music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "9tQHsF2iPn6dpfooYHBwHQ"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save!